<script>
import PageVideo from '@/components/content/page_video/PageVideo.vue';
import PageCode from "@/components/content/page_code/PageCode.vue";

export default {
  name: 'PageContent',
  components: {PageCode, PageVideo}
}
</script>

<template>
  <div class="page-content-view">
    <!--    Content -->

    <h1>Что такое Vue.js?</h1>
    <hr/>
    <p>
      Vue (произносится /vjuː/, примерно как view) — это прогрессивный фреймворк для создания пользовательских интерфейсов.
      В отличие от фреймворков-монолитов, Vue создан пригодным для постепенного внедрения.
      Его ядро в первую очередь решает задачи уровня представления (view), что упрощает интеграцию с другими библиотеками и существующими проектами.
      С другой стороны, Vue полностью подходит и для создания сложных одностраничных приложений (SPA, Single-Page Applications), если использовать
      его совместно с современными инструментами и дополнительными библиотеками.
    </p>

    <p>
      Если вы хотите узнать больше о Vue перед тем как начать, мы <a href="https://ru.vuejs.org/v2/guide/#" target="_blank">создали видео</a>
      с рассказом об основных принципах работы на примере проекта.
    </p>

    <p>
      Если вы — опытный фронтенд-разработчик, и хотите узнать, чем Vue отличается от остальных библиотек или фреймворков,
      обратите внимание на сравнение с другими фреймворками.
    </p>

    <PageVideo />

    <h2>Начало работы</h2>
    <hr />

    <blockquote>
      В этом руководстве мы предполагаем, что вы уже знакомы с HTML, CSS и JavaScript на базовом уровне.
      Если же вы во фронтенд-разработке совсем новичок, начинать сразу с изучения фреймворка может быть не лучшей
      идеей — возвращайтесь, разобравшись с основами! Наличие опыта работы с другими фреймворками может помочь,
      но не является обязательным.
    </blockquote>

    <p>
      Проще всего попробовать Vue.js, начав с примера Hello World.
      Откройте его в другой вкладке, и изменяйте по ходу чтения руководства.
      Можно и просто создать <code>index.html</code> файл на диске и подключить Vue:
    </p>

    <PageCode />

    <p>
      В разделе по установке описаны и другие варианты установки Vue.
      Обратите внимание, мы не рекомендуем новичкам начинать с vue-cli, особенно если
      нет опыта работы с инструментами сборки Node.js.
    </p>

    <p>
      Если предпочитаете что-то более интерактивное, можете пройти эту серию уроков на Scrimba,
      которая представляет собой сочетание скринкастов и песочницы для проверки примеров кода,
      где вы можете остановиться и продолжить изучение в любое время.
    </p>

    <p>
      <img src="https://ru.vuejs.org/images/components.png" alt="Дерево Компонентов">
    </p>

    <h2>Готовы к большему?</h2>
    <hr />
    <p>
      Пока мы лишь кратко представили самые основные возможности ядра Vue.js — остаток
      этого руководства посвящён более детальному рассмотрению этих и других
      возможностей, поэтому советуем прочитать его целиком!
    </p>

    <!--    Content / -->
  </div>
</template>

<style lang="scss" src="./page_content.scss"></style>
